import pytest
from exercise1 import get_unique_names
from exercise2 import get_lowest_course, get_highest_course
from exercise3 import get_sort_course

courses = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля",
           "Frontend-разработчик с нуля"]
mentors = [
    ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев",
     "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
     "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов",
     "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
    ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский",
     "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков",
     "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
    ["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев",
     "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков",
     "Роман Гордиенко"],
    ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
     "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]
durations = [14, 20, 12, 20]


def test_get_unique_names():
    expected = {
        'Адилет', 'Азамат', 'Александр', 'Алексей', 'Алена', 'Анатолий', 'Анна', 'Антон', 'Вадим', 'Валерий',
        'Владимир', 'Денис', 'Дмитрий', 'Евгений', 'Елена', 'Иван', 'Илья', 'Кирилл', 'Константин', 'Максим',
        'Михаил', 'Никита', 'Николай', 'Олег', 'Павел', 'Ринат', 'Роман', 'Сергей', 'Татьяна', 'Тимур', 'Филипп',
        'Эдгар', 'Юрий'
    }
    assert get_unique_names(mentors).__eq__(expected)


def test_get_lowest_course():
    expected = ['Python-разработчик с нуля']
    assert get_lowest_course(courses, mentors, durations).__eq__(expected)


def test_get_highest_course():
    expected = ['Fullstack-разработчик на Python', 'Frontend-разработчик с нуля']
    assert get_highest_course(courses, mentors, durations).__eq__(expected)


def test_get_sort_course():
    expected = ['Python-разработчик с нуля - 12 месяцев', 'Java-разработчик с нуля - 14 месяцев',
                'Fullstack-разработчик на Python - 20 месяцев', 'Frontend-разработчик с нуля - 20 месяцев']
    assert get_sort_course(courses, mentors, durations).__eq__(expected)
